<?php
include "path.php";
?>
<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=0.9" />

    <title>КБИС</title>


    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.0-alpha1/dist/css/bootstrap.min.css" rel="stylesheet"
        integrity="sha384-GLhlTQ8iRABdZLl6O3oVMWSktQOp6b7In1Zl3/Jr59b6EGGoI1aFkw7cmDA6j6gD" crossorigin="anonymous" />

    <link rel="stylesheet" href="assets/css/abo.css" />

    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link
        href="https://fonts.googleapis.com/css2?family=Montserrat:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap"
        rel="stylesheet">
</head>

<body>


    <?php include("app/include/header.php"); ?>

    <div class="containerh">

        <div class="about">
            <h2>Информация о кафедре "Кибербезопасность информационных систем"</h2>
            <p>
                Кафедра «Кибербезопасность информационных систем» федерального государственного бюджетного
                образовательного учреждения высшего образования «Донской Государственный Технический университет»
                На основании приказа ректора ДГТУ № 60 от 28.03.2014 г из факультета «Механико-технологический» была
                выведена кафедра «Информационные технологии в сервисе» и на основании этого же приказа, кафедра была
                переименована и введена в состав факультета «Информатика и вычислительная техника».
                <br>
                <br>
                Первым заведующим кафедрой стал доктор технических наук, профессор Безуглов Дмитрий Анатольевич. С
                июля 2015 года заведующий кафедрой - кандидат технических наук, доцент Жуков Александр Игоревич.
                <br>
                <br>
                Реализуемые направления подготовки:
                <br>
                <br>
                10.05.01 Компьютерная безопасность
                <br>
                <br>
                Срок обучения – 5,5 лет (очно)
                <br>
                <br>
                Квалификация, присваиваемая выпускникам – специалист по защите информации
                <br>
                <br>
                В рамках основной профессиональной образовательной программы "Компьютерная безопасность" реализуется
                обучение технологиям проектирования и разработке методов защиты для современных
                информационно-измерительных систем, вычислительных сетей, предназначенных для получения, передачи и
                хранения ценной объективной информации. Такая информация должна иметь требуемый уровень целостности,
                доступности, конфиденциальности, неотрекаемости, а каналы передачи информации в системах данного
                типа должны быть безопасны.
                <br>
                <br>
                Основная цель - подготовка специалистов к решению профессиональных задач в области комплексной
                защиты объектов информатизации, умеющих определять цели, стратегии и политику корпоративной
                безопасности, которые необходимы для обеспечения информационной безопасности в достаточном объеме
                для реализации функции управления проектами создания, эксплуатации и развития современных
                информационно-телекоммуникационных систем.
                <br>
                <br>
                В ходе реализации образовательной программы изучаются такие языки программирования: Python, C, C++,
                JavaScript, PHP, HTML, рассматриваются вопросы реализации информационных систем с использованием
                реляционных СУБД, вопросы защищенной передачи данных; студентов обучают работать со средствами
                защиты информации SecretNet, Скорпион, Баррикада, Соната, Dallas lock 8.0.
                <br>
                <br>
                09.03.01 Информатика и вычислительная техника
                <br>
                <br>
                Срок обучения – 4 года (очно)
                <br>
                <br>
                Квалификация, присваиваемая выпускникам - бакалавр
                <br>
                <br>
                Основной целью программы является подготовка профессионалов в области исследования и проектирования
                вычислительных устройств, систем и компьютерных сетей нового поколения, в том числе вычислительных
                комплексов и коммуникационных систем, распределенных систем сбора и обработки информации, методов и
                средств управления ИТ-ресурсами.
                <br>
                <br>
                Цели и задачи образовательной программы: 1. Формирование знаний, умений и навыков, позволяющих
                осуществлять научно-исследовательскую, проектную, эксплуатационную и педагогическую профессиональную
                деятельность в области исследования и разработки программно-аппаратных компонентов средств
                вычислительной техники, автоматизированных систем и компьютерных сетей. 2. Развитие способностей к
                комплексному инженерному анализу с использованием современных математических моделей и методов для
                обоснования новых разработок в области средств вычислительной техники, автоматизированных систем и
                компьютерных сетей. 3. Формирование знаний, умений и навыков выполнения комплексных инженерных
                проектов средств вычислительной техники, автоматизированных систем и компьютерных сетей. 4.
                Формирование в соответствии с выбранной специализацией знаний, умений и навыков, отвечающих
                актуальным и потенциальным запросам работодателей. Формирование у выпускников норм правовой и
                профессиональной этики, социальной ответственности за результаты своей профессиональной
                деятельности.
                <br>
                <br>
                В ходе реализации образовательной программы изучаются такие языки программирования: Python, C, C++,
                JavaScript, PHP, HTML, рассматриваются вопросы реализации информационных систем с использованием
                реляционных СУБД
                <br>
                <br>
                09.04.01 Информатика и вычислительная техника
                <br>
                <br>
                Срок обучения – 2 года (очно)
                <br>
                <br>
                Квалификация, присваиваемая выпускникам - магистр
                <br>
                <br>
                Развитие у обучающихся личностных качеств, а также формирование общекультурных (универсальных) и
                профессиональных компетенций в соответствии с требованиями ФГОС ВО по направлению подготовки
                Информатика и вычислительная техника, позволяющего выпускнику успешно работать в избранной сфере
                деятельности, обладать универсальными и предметно-специализированными компетенциями, способствующими
                его социальной мобильности и устойчивости на рынке труда.
                <br>
                <br>
                Целями образовательной программы магистратуры являются: организация магистерской подготовки,
                позволяющей ее выпускникам продолжить образование для самосовершенствования или получения ученой
                степени более высокого уровня; получение профилированного образования высокого уровня, позволяющего
                выпускнику успешно проводить исследования и разработки, направленные на создание и обеспечение
                функционирования программного обеспечения средств вычислительной техники и автоматизированных
                систем, решать сложные инженерные задачи в проектно-конструкторской, проектно-технологической и
                научно-исследовательской сферах, а также принимать активное участие в научно-педагогической и
                организационно-управленческой деятельности предприятий, организаций и учреждений, обладать
                компетенциями, способствующими его социальной мобильности и устойчивости на рынке труда.
                <br>
                <br>
                Виды профессиональной деятельности, к которому (которым) готовятся выпускники:
                научно-исследовательская деятельность, проектная деятельность, производственно-технологическая
                деятельность.
            </p>
        </div>
    </div>

    <?php include("app/include/footer.php"); ?>

    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.0-alpha1/dist/js/bootstrap.bundle.min.js"
        integrity="sha384-w76AqPfDkMBDXo30jS1Sgez6pr3x5MlQ1ZAGC+nuZB+EYdgRZgiwxhTBTkF7CXvN"
        crossorigin="anonymous"></script>
</body>

</html>